toasterllc/MDCCode/Code/MSP430/MSPApp/main.cpp
    _SDTask::Wait();
    
    if (!_State.sd.valid || !_CardIdVerified) {
        SD::CardId cardId;
        SD::CardData cardData;
        
        _Scheduler::Start<_SDTask>([] { _SDCard.enable(&cardId, &cardData); });
        _SDTask::Wait();
        
        if (!_State.sd.valid) {
            _State.sd.cardId = cardId;
            _State.sd.imgCap = ;
//            // cardId: the SD card's CID, used to determine when the SD card has been
//            // changed, and therefore we need to update `imgCap` and reset `ringBufs`
//            SD::CardId cardId;
//            // imgCap: image capacity; the number of images that bounds the ring buffer
//            uint32_t imgCap = 0;
//            // ringBufs: tracks captured images on the SD card; 2 copies in case there's a
//            // power failure
//            ImgRingBuf ringBufs[2] = {};
//            uint16_t valid = false; // uint16_t (instead of bool) for alignment
        }
    
    } else {
        _Scheduler::Start<_SDTask>([] { _SDCard.enable(); });
    }
    
    if (cardIdPtr || cardDataPtr) {
        _SDCard.enable(cardIdPtr, cardDataPtr);
    } else {
        _SDTask::Wait();
        _Scheduler::Start<_SDTask>([] { _SDCard.enable(); });
    }
    
    
    _SDCard.enable(cardIdPtr, cardDataPtr);
    
    
    if (!_State.sd.valid || !_CardIdVerified) {
        
    }
    
    
}

struct _ImgTask {
    static void Enable() {
        Wait();
        _Scheduler::Start<_ImgTask>([] {
            // Initialize image sensor
            _ImgSensor::Enable();
            // Set the initial exposure _before_ we enable streaming, so that the very first frame
            // has the correct exposure, so we don't have to skip any frames on the first capture.
            _ImgSensor::SetCoarseIntTime(_ImgAutoExp.integrationTime());
            // Enable image streaming
            _ImgSensor::SetStreamEnabled(true);
        });
    }
    
    static void Disable() {
        Wait();
        _Scheduler::Start<_ImgTask>(_ImgSensor::Disable);
    }
    
    static void Wait() {
        _Scheduler::Wait<_ImgTask>();
    }
    
    // Task options
    static constexpr Toastbox::TaskOptions Options{};
    
    // Task stack
    [[gnu::section(".stack._ImgTask")]]
    static inline uint8_t Stack[128];
};

// MARK: - Motion

static volatile bool _Motion = false;
static volatile bool _Busy = false;

template <typename T>
static void _ImgRingBufSet(volatile MSP::ImgRingBuf& dst, const T& src) {
    FRAMWriteEn writeEn; // Enable FRAM writing
    
    dst.magic = 0;
    atomic_thread_fence(std::memory_order_seq_cst);
    
    (const_cast<MSP::ImgRingBuf&>(dst)).buf = const_cast<MSP::ImgRingBuf&>(src).buf;
    atomic_thread_fence(std::memory_order_seq_cst);
    
    dst.magic = MSP::ImgRingBuf::MagicNumber;
}

// _ImgRingBufInit: find the correct ring buffer (the one with the greatest id and a valid magic number)
// and copy it into the other slot so that there are two copies. If neither slot contains a valid ring
// buffer, reset them both so that they're both empty (and valid).
static void _ImgRingBufInit() {
    using namespace MSP;
    auto newest = &_State.img.ringBuf;
    auto oldest = &_State.img.ringBuf2;
    const bool br = ImgRingBuf::FindLatest(newest, oldest);
    if (br) {
        _ImgRingBufSet(*oldest, *newest);
    
    } else {
        // Both ringBuf and ringBuf2 are invalid
        // Reset them both
        _ImgRingBufSet(_State.img.ringBuf, MSP::ImgRingBuf{});
        _ImgRingBufSet(_State.img.ringBuf2, MSP::ImgRingBuf{});
    }
}

static void _ImgRingBufIncrement() {
    using namespace MSP;
    
    // Update _State.img.ringBuf
    {
        ImgRingBuf ringBufCopy = const_cast<ImgRingBuf&>(_State.img.ringBuf);
        
        // Update write index
        ringBufCopy.buf.widx++;
        // Wrap widx
        if (ringBufCopy.buf.widx >= _State.img.cap) ringBufCopy.buf.widx = 0;
        
        // Update read index (if we're currently full)
        if (ringBufCopy.buf.full) {
            ringBufCopy.buf.ridx++;
            // Wrap ridx
            if (ringBufCopy.buf.ridx >= _State.img.cap) ringBufCopy.buf.ridx = 0;
            
            // Update the beginning image id (which only gets incremented if we're full)
            ringBufCopy.buf.idBegin++;
        }
        
        // Update the end image id (the next image id that'll be used)
        ringBufCopy.buf.idEnd++;
        
        if (ringBufCopy.buf.widx == ringBufCopy.buf.ridx) ringBufCopy.buf.full = true;
        
        _ImgRingBufSet(_State.img.ringBuf, ringBufCopy);
    }
    
    // Update _State.img.ringBuf2
    {
        // Set ringBuf2 = ringBuf
        _ImgRingBufSet(_State.img.ringBuf2, _State.img.ringBuf);
    }
}

static void _ImgCapture() {
    const auto& ringBuf = _State.img.ringBuf.buf;
    
    // Asynchronously turn on the image sensor / SD card
    _ImgTask::Enable();
    _SDTask::Enable();
    
    // Wait until the image sensor is ready
    _ImgTask::Wait();
    
    // Try up to `CaptureAttemptCount` times to capture a properly-exposed image
    constexpr uint8_t CaptureAttemptCount = 3;
    uint8_t bestExpBlock = 0;
    uint8_t bestExpScore = 0;
    for (uint8_t i=0; i<CaptureAttemptCount; i++) {
        // skipCount:
        // On the initial capture, we didn't set the exposure, so we don't need to skip any images.
        // On subsequent captures, we did set the exposure before the capture, so we need to skip a single
        // image since the first image after setting the exposure is invalid.
        const uint8_t skipCount = (!i ? 0 : 1);
        
        // expBlock: Store images in the block belonging to the worst-exposed image captured so far
        const uint8_t expBlock = !bestExpBlock;
        
        // Populate the header
        static Img::Header header = {
            .magic          = Img::Header::MagicNumber,
            .version        = Img::Header::Version,
            .imageWidth     = Img::PixelWidth,
            .imageHeight    = Img::PixelHeight,
            .coarseIntTime  = 0,
            .analogGain     = 0,
            .id             = 0,
            .timeStart      = 0,
            .timeDelta      = 0,
        };
        
        header.coarseIntTime = _ImgAutoExp.integrationTime();
        header.id = ringBuf.idEnd;
        
        const MSP::Time t = _RTC.time();
        header.timeStart = t.start;
        header.timeDelta = t.delta;
        
        // Capture an image to RAM
        const _ICE::ImgCaptureStatusResp resp = _ICE::ImgCapture(header, expBlock, skipCount);
        const uint8_t expScore = _ImgAutoExp.update(resp.highlightCount(), resp.shadowCount());
        if (!bestExpScore || (expScore > bestExpScore)) {
            bestExpBlock = expBlock;
            bestExpScore = expScore;
        }
        
        // We're done if we don't have any exposure changes
        if (!_ImgAutoExp.changed()) break;
        
        // Update the exposure
        _ImgSensor::SetCoarseIntTime(_ImgAutoExp.integrationTime());
    }
    
    // Wait until the SD card is ready
    _SDTask::Wait();
    
    // Write the best-exposed image to the SD card
    _SDCard.writeImage(bestExpBlock, ringBuf.widx);
    
    // Update _State.img
    _ImgRingBufIncrement();
}

// MARK: - Interrupts

[[gnu::interrupt(RTC_VECTOR)]]
static void _ISR_RTC() {
    _RTC.isr();
}

[[gnu::interrupt(PORT2_VECTOR)]]
static void _ISR_Port2() {
    // Accessing `P2IV` automatically clears the highest-priority interrupt
    switch (__even_in_range(P2IV, P2IV__P2IFG5)) {
    case P2IV__P2IFG5:
        _Motion = true;
        // Wake ourself
        __bic_SR_register_on_exit(LPM3_bits);
        break;
    
    default:
        break;
    }
}

[[gnu::interrupt(WDT_VECTOR)]]
static void _ISR_SysTick() {
    const bool wake = _Scheduler::Tick();
    if (wake) {
        // Wake ourself
        __bic_SR_register_on_exit(LPM3_bits);
    }
}

// MARK: - ICE40

template<>
void _ICE::Transfer(const Msg& msg, Resp* resp) {
    AssertArg((bool)resp == (bool)(msg.type & _ICE::MsgType::Resp));
    
    // Init SPI peripheral
    static bool spiInit = false;
    if (!spiInit) {
        spiInit = true;
        _SPI::Init();
    }
    
    // iceInit: Stored in BAKMEM (RAM that's retained in LPM3.5) so that
    // it's maintained during sleep, but reset upon a cold start.
    [[gnu::section(".ram_backup.main")]]
    static bool iceInit = false;
    
    // Init ICE comms
    if (!iceInit) {
        iceInit = true;
        // Reset ICE comms (by asserting SPI CLK for some length of time)
        _SPI::ICEReset();
        // Init ICE comms
        _ICE::Init();
    }
    
//    // Init ICE40 if we haven't done so yet
//    static bool iceInit = false;
//    if (!iceInit) {
//        // Init SPI/ICE40
//        if (Startup::ColdStart()) {
//            constexpr bool iceReset = true; // Cold start -> reset ICE40 SPI state machine
//            _SPI::Init(iceReset);
//            _ICE::Init(); // Cold start -> init ICE40 to verify that comms are working
//        
//        } else {
//            constexpr bool iceReset = false; // Warm start -> no need to reset ICE40 SPI state machine
//            _SPI::Init(iceReset);
//        }
//    }
    
    _SPI::WriteRead(msg, resp);
}

